app/views/index/bookcollection.html.erb

                <% @user_book_relations.each do |user_book| %>
                    <% book = Book.find(user_book[:book_id]) %>
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 17]]