app/views/index/coursecollection.html.erb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
---
                <% @user_course_relations.each do |user_course| %>
                    <% course = Course.find(user_course[:course_id]) %>