app/views/index/index_login.html.erb

SELECT "books".* FROM "books"  ORDER BY created_at desc
SELECT COUNT(*) FROM "books"
---
	  <% m = 9 %>
	  <% if Book.all.count<10 %>

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
        <% for i in 0...number  %>
            <% book = Book.find(@lastest_comments[i].book_id) %>
            <% user = User.find(@lastest_comments[i].user_id) %>