app/views/index/usercenter.html.erb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 14]]
---
                    <% for i in 0...number %>
                        <% course = Course.find(@user_course_relations[i].course_id) %>

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 16]]
---
                    <% for i in 0...number %>
                        <% book = Book.find(@user_book_relations[i].book_id) %>