app/views/books/bookdetail.html.erb

UPDATE "books" SET "clicks" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["clicks", 122], ["updated_at", "2016-01-22 05:40:07.317491"], ["id", 1]]
---
                    <td class="bd-attr">修改时间:</td>
                    <td><%= @book.updated_at %></td>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
                  <li class= "list-group-item">
                    <h4 class="list-group-item-heading"><%= User.find(@reviews[i].user_id).nickname %><span class="p-c"><span class="glyphicon glyphicon-thumbs-up" aria-hidden="true"></span><span class="badge"><%= @reviews[i].pro %></span><span class="glyphicon glyphicon-thumbs-down" aria-hidden="true"></span><span class="badge"><%= @reviews[i].con %></span>