app/views/books/topicdetail.html.erb

            <% @reply_relation.each do |reply_relation| %>
                <% reply_topic = BookNote.find(reply_relation.reply_id) %>
---
SELECT  "book_notes".* FROM "book_notes" WHERE "book_notes"."id" = ? LIMIT 1  [["id", 1]]

                      <h4 class="list-group-item-heading reply-title"></h4>
                      <h5 class="list-group-item-heading reply-at"><%= User.find(reply_topic.user_id).nickname %> &nbsp 2016-01-01 20:55:55</h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]