app/controllers/books_controller.rb

UPDATE "books" SET "clicks" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["clicks", 4], ["updated_at", "2016-01-23 12:03:27.052311"], ["id", 1]]
---
  def show
    @book.clicks = @book.clicks + 1
    @book.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "userbooks" WHERE (user_id = 2 and book_id = '1')
UPDATE "books" SET "clicks" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["clicks", 122], ["updated_at", "2016-01-22 05:40:07.317491"], ["id", 1]]
SELECT  "courses".* FROM "courses" INNER JOIN "coursebooks" ON "courses"."id" = "coursebooks"."course_id" WHERE "coursebooks"."book_id" = ?  ORDER BY clicks desc LIMIT 5  [["book_id", 1]]
SELECT  "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."book_id" = ?  ORDER BY pro desc LIMIT 10  [["book_id", 1]]
SELECT  "book_notes".* FROM "book_notes" WHERE "book_notes"."book_id" = ? AND (content_type = 0)  ORDER BY pro desc LIMIT 10  [["book_id", 1]]
---
  def bookdetail
    @collected = false
    if session[:user_id].nil?
      @user = nil
    else
      @user = User.find(session[:user_id])
      if Userbook.where('user_id = ? and book_id = ?',session[:user_id],params[:id]).count > 0
        @collected = true
      end
    end
    @book = Book.find(params[:id])
    #Add clicks
    @book.clicks = @book.clicks + 1
    @book.save!
    #For view rendering
    @course_related = @book.courses.order('clicks desc').limit(5)
    @reviews = @book.book_reviews.order('pro desc').limit(10)
    @articles = @book.book_notes.where('content_type = ?',0).order('pro desc').limit(10)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "book_notes" ("book_id", "title", "user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["book_id", 1], ["title", "123"], ["user_id", 3], ["content", "123"], ["created_at", "2016-01-23 12:01:00.429799"], ["updated_at", "2016-01-23 12:01:00.429799"]]
---
  def write_note
    #Check for login
    if session[:user_id].nil?
      flash[:notice] = "请先登录!"
      redirect_to root_path
      return
    end
    user_id = session[:user_id]
    book_id = params[:book_id]
    if user_id.nil?
      redirect_to root_path
      return
    end
    if book_id.nil? or params[:title].nil? or params[:content].nil?
      return
    end
    if Book.find(book_id.to_i).nil?
      return
    end
    book = Book.find(book_id)
    new_note =  book.book_notes.new
    new_note.title = params[:title].strip
    new_note.user_id = user_id
    new_note.content = params[:content].strip
    new_note.content_type = 0
    if new_note.save!

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "book_notes".* FROM "book_notes" WHERE "book_notes"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "topic_relations".* FROM "topic_relations" WHERE (topic_id = '1')  ORDER BY created_at asc
---
  def topicdetail
    #topics include notes & questions
    book_id = params[:book_id]
    note_id = params[:note_id]
    page = params[:page]
    session[:book_id] = book_id
    session[:page] = page
    session[:note_id] = note_id
    @book = Book.find(book_id)
    @topic = BookNote.find(note_id)
    @topic_owner = User.find(@topic.user_id)
    @reply_relation = TopicRelation.where('topic_id = ?',note_id).order('created_at asc')

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "book_notes" ("book_id", "title", "user_id", "content", "page", "content_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def post_reply_for_article
    if session[:user_id].nil?
      flash[:notice] = "请先登录!"
      redirect_to root_path
      return
    end
    if session[:book_id].nil?
      redirect_to show_path sth:'session[:book_id].nil?'
      return
    end
    if session[:note_id].nil?
      redirect_to show_path sth:'session[:note_id].nil?'
      return
    end
    #floor = params[:floor].to_i
    #Store the content
    reply_topic_id = params[:reply_topic_id].to_i
    if reply_topic_id.nil? or reply_topic_id == 0
      reply_topic_id = session[:note_id].to_i
    end
    book = Book.find(session[:book_id].to_i)
    new_note =  book.book_notes.new
    new_note.title = params[:title].strip
    new_note.user_id = session[:user_id].to_i
    new_note.content = params[:content].strip
    new_note.page = session[:page].to_i
    new_note.content_type = 3
    new_note.save!

INSERT INTO "topic_relations" ("topic_id", "reply_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["topic_id", 1], ["reply_id", 2], ["created_at", "2016-01-23 12:01:11.476180"], ["updated_at", "2016-01-23 12:01:11.476180"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "users" SET "score" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["score", 10], ["updated_at", "2016-01-23 12:01:11.493945"], ["id", 3]]
SELECT  "book_notes".* FROM "book_notes" WHERE "book_notes"."id" = ? LIMIT 1  [["id", 1]]
---
    topic_relation = TopicRelation.new
    topic_relation.topic_id = session[:note_id]
    topic_relation.reply_id = new_note.id
    topic_relation.save!

    #Update user state
    user = User.find(session[:user_id])
    user.score += 10
    user.save!

    #Create message for the user who was commented by current user
    if BookNote.find(session[:note_id].to_i).content_type == 0

INSERT INTO "userinfos" ("title", "user_id", "publisher", "content", "publisher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    commented_user = User.find(BookNote.find(reply_topic_id.to_i).user_id)
    uinfo_content = User.find(session[:user_id]).nickname+'和你有了新的互动,查看地址： ' + book_topic_url(book_id: session[:book_id].to_i,note_id: session[:note_id].to_i)
    uinfo = Userinfo.new(title: title, user_id: commented_user.id,publisher: commented_user.nickname,content: uinfo_content,publisher_id: session[:user_id].to_i)
    uinfo.save!

SELECT  "courses".* FROM "courses" WHERE (title like '%sh%') LIMIT 5
---
  def related_course
    keyword = params[:kwd]
    unless keyword.nil? or keyword == ''
      pattern = 'title like ?','%'+keyword+'%'
      @suggest = Course.where(pattern).limit(5)