app/controllers/courses_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "usercourses" WHERE (user_id = 2 and course_id = '1')
SELECT  "books".* FROM "books" INNER JOIN "coursebooks" ON "books"."id" = "coursebooks"."book_id" WHERE "coursebooks"."course_id" = ?  ORDER BY id desc LIMIT 5  [["course_id", 1]]
---
  def coursedetail
    @collected = false
    if session[:user_id].nil?
      @user = nil
    else
      @user = User.find(session[:user_id])
      if Usercourse.where('user_id = ? and course_id = ?',session[:user_id],params[:id]).count > 0
        @collected = true
      end
    end
    @course = Course.find(params[:id])
    #Add clicks
    #For view rendering
    @book_related = @course.books.order('id desc').limit(5)