app/controllers/index_controller.rb

SELECT "books".* FROM "books"  ORDER BY created_at desc
SELECT "books".* FROM "books"  ORDER BY clicks desc
SELECT "courses".* FROM "courses"  ORDER BY clicks desc
SELECT  "book_reviews".* FROM "book_reviews"  ORDER BY "book_reviews"."id" DESC LIMIT 3
---
  def main
    @lastest_books = Book.all.order('created_at desc')
    @pop_books = Book.all.order('clicks desc')
    @pop_courses = Course.all.order('clicks desc')
    @lastest_comments = BookReview.last(3)

SELECT "books".* FROM "books"  ORDER BY created_at desc
SELECT "books".* FROM "books"  ORDER BY clicks desc
SELECT "courses".* FROM "courses"  ORDER BY clicks desc
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "book_reviews".* FROM "book_reviews"  ORDER BY "book_reviews"."id" DESC LIMIT 3
---
  def index_login
    if session[:user_id].nil?
      redirect_to root_path
      return
    end
    @lastest_books = Book.all.order('created_at desc')
    @pop_books = Book.all.order('clicks desc')
    @pop_courses = Course.all.order('clicks desc')
    @user = User.find(session[:user_id])
    @lastest_comments = BookReview.last(3)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "contributions".* FROM "contributions" WHERE (content_type = 0 and user_id = 2)  ORDER BY updated_at desc LIMIT 5
---
  def usercenter
    if session[:user_id].nil?
      redirect_to root_path
      return
    end
    @user = User.find(session[:user_id].to_i)
    @user_course_relations = Usercourse.where('user_id = ?',session[:user_id]).order('updated_at desc')
    @user_book_relations = Userbook.where('user_id = ?',session[:user_id]).order('updated_at desc')

    @course_contributions = Contribution.where('content_type = 0 and user_id = ?',session[:user_id]).order('updated_at desc').limit(5)

SELECT  "books".* FROM "books" WHERE (title like '%%') LIMIT 5 OFFSET 0
---
  def searchforbooksresults
    #store in session
    session[:keywords] = params[:keywords]
    @keywords = params[:keywords]
    @page = params[:page].to_i
    if @keywords == '*' or @keywords.nil?
      @keywords = ''
    end
    pattern = 'title like ?','%'+@keywords+'%'
    @page_count = (Book.where(pattern).length / 5.0).ceil

SELECT  "courses".* FROM "courses" WHERE (title like '%%') LIMIT 5 OFFSET 0
---
  def searchforcoursesresults
    @keywords = params[:keywords]
    @page = params[:page].to_i
    if @keywords == '*' or @keywords.nil?
      @keywords = ''
    end
    @pattern = 'title like ?','%'+@keywords+'%'
    @page_count = (Course.where(@pattern).length / 5.0).ceil

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "books".* FROM "books" INNER JOIN "userbooks" ON "books"."id" = "userbooks"."book_id" WHERE "userbooks"."user_id" = ?  [["user_id", 2]]
SELECT  "userbooks".* FROM "userbooks" WHERE "userbooks"."user_id" = ?  ORDER BY created_at desc LIMIT 5 OFFSET -5  [["user_id", 4]]
---
  def bookcollection
    if session[:user_id].nil?
      flash[:notice] = "请先登录!"
      redirect_to root_path
      return
    end
    #store in session
    session[:keywords] = params[:keywords]
    @page = params[:page].to_i
    @keywords = params[:keywords]
    @page_count = (User.find(session[:user_id].to_i).books.length / 5.0).ceil
    @no_record = false
    if @keywords == '*' or @keywords.nil?
      @keywords = ''
    end
    if @page_count == 0
      @no_record = true
      return
    end
    if @page==0
      @page++
    end
    @user_book_relations = Userbook.where(user_id: session[:user_id].to_i).order('created_at desc').offset((@page - 1) * 5).limit(5)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "courses".* FROM "courses" INNER JOIN "usercourses" ON "courses"."id" = "usercourses"."course_id" WHERE "usercourses"."user_id" = ?  [["user_id", 2]]
SELECT  "usercourses".* FROM "usercourses" WHERE "usercourses"."user_id" = ?  ORDER BY created_at desc LIMIT 5 OFFSET -5  [["user_id", 4]]
---
  def coursecollection
    if session[:user_id].nil?
      flash[:notice] = "请先登录!"
      redirect_to root_path
      return
    end
    @keywords = params[:keywords]
    @page = params[:page].to_i
    @page_count = (User.find(session[:user_id].to_i).courses.length / 5.0).ceil
    @no_record = false
    if @keywords == '*' or @keywords.nil?
      @keywords = ''
    end
    if @page_count == 0
      @no_record = true
      return
    end
    @user_course_relations = Usercourse.where(user_id: session[:user_id].to_i).order('created_at desc').offset((@page - 1) * 5).limit(5)