app/controllers/upload_controller.rb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 1]]
---
  def picture
    @picture = Picture.find(params[:id])