app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "123@123"]]
---
  def login
    #@login_info = user_params
    @user = User.find_by(email:params[:email])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT COUNT(*) FROM "userbooks" WHERE (user_id = 4 and book_id = '1')
INSERT INTO "userbooks" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["book_id", 1], ["created_at", "2016-01-22 05:51:41.544285"], ["updated_at", "2016-01-22 05:51:41.544285"]]
---
  def like_or_dislike_book
    @book = Book.find(params[:book_id])
    @user = User.find(session[:user_id])
    if @user.nil?
      redirect_to root_path
    end
    if Userbook.where('user_id = ? and book_id = ?',session[:user_id],params[:book_id]).count <= 0
      #I do not have this book.
      @user.books << @book

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT COUNT(*) FROM "usercourses" WHERE (user_id = 4 and course_id = '1')
INSERT INTO "usercourses" ("user_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["course_id", 1], ["created_at", "2016-01-22 05:50:18.320284"], ["updated_at", "2016-01-22 05:50:18.320284"]]
---
  def like_or_dislike_course
    @course = Course.find(params[:course_id])
    @user = User.find(session[:user_id])
    if @user.nil? or  @course.nil?
      redirect_to root_path
    end
    if Usercourse.where('user_id = ? and course_id = ?',session[:user_id],params[:course_id]).count <= 0
      #I do not have this book.
      @user.courses <<  @course

INSERT INTO "users" ("email", "password_digest", "nickname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
      if @user.save